KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32L486.svd
            <register>
               <name>AHB1SMENR</name>
               <displayName>AHB1SMENR</displayName>
               <description>AHB1 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00011303</resetValue>
               <fields>
                  <field>
                     <name>TSCSMEN</name>
                     <description>Touch Sensing Controller clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCSMEN</name>
                     <description>CRCSMEN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM1SMEN</name>
                     <description>SRAM1 interface clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLASHSMEN</name>
                     <description>Flash memory interface clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2SMEN</name>
                     <description>DMA2 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1SMEN</name>
                     <description>DMA1 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2DSMEN</name>
                     <description>DMA2D clock enable during Sleep and Stop               modes</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB2SMENR</name>
               <displayName>AHB2SMENR</displayName>
               <description>AHB2 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000532FF</resetValue>
               <fields>
                  <field>
                     <name>RNGSMEN</name>
                     <description>Random Number Generator clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AESSMEN</name>
                     <description>AES accelerator clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCFSSMEN</name>
                     <description>ADC clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTGFSSMEN</name>
                     <description>OTG full speed clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2SMEN</name>
                     <description>SRAM2 interface clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOHSMEN</name>
                     <description>IO port H clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOGSMEN</name>
                     <description>IO port G clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOFSMEN</name>
                     <description>IO port F clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOESMEN</name>
                     <description>IO port E clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIODSMEN</name>
                     <description>IO port D clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCSMEN</name>
                     <description>IO port C clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBSMEN</name>
                     <description>IO port B clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOASMEN</name>
                     <description>IO port A clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOISMEN</name>
                     <description>IO port I clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCMISMEN</name>
                     <description>DCMI clock enable during Sleep and Stop               modes</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HASH1SMEN</name>
                     <description>HASH clock enable during Sleep and Stop               modes</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB3SMENR</name>
               <displayName>AHB3SMENR</displayName>
               <description>AHB3 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000101</resetValue>
               <fields>
                  <field>
                     <name>QSPISMEN</name>
                     <description>QSPISMEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMCSMEN</name>
                     <description>Flexible memory controller clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR1</name>
               <displayName>APB1SMENR1</displayName>
               <description>APB1SMENR1</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xF2FECA3F</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SMEN</name>
                     <description>Low power timer 1 clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAMPSMEN</name>
                     <description>OPAMP interface clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAC1SMEN</name>
                     <description>DAC1 interface clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRSMEN</name>
                     <description>Power interface clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN1SMEN</name>
                     <description>CAN1 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SMEN</name>
                     <description>I2C3 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SMEN</name>
                     <description>I2C2 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SMEN</name>
                     <description>I2C1 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART5SMEN</name>
                     <description>UART5 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART4SMEN</name>
                     <description>UART4 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART3SMEN</name>
                     <description>USART3 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SMEN</name>
                     <description>USART2 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SP3SMEN</name>
                     <description>SPI3 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2SMEN</name>
                     <description>SPI2 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGSMEN</name>
                     <description>Window watchdog clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDSMEN</name>
                     <description>LCD clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM7SMEN</name>
                     <description>TIM7 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6SMEN</name>
                     <description>TIM6 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM5SMEN</name>
                     <description>TIM5 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM4SMEN</name>
                     <description>TIM4 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM3SMEN</name>
                     <description>TIM3 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2SMEN</name>
                     <description>TIM2 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAPBSMEN</name>
                     <description>RTC APB clock enable during Sleep and               Stop modes</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN2SMEN</name>
                     <description>CAN2 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR2</name>
               <displayName>APB1SMENR2</displayName>
               <description>APB1 peripheral clocks enable in Sleep and           Stop modes register 2</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000025</resetValue>
               <fields>
                  <field>
                     <name>LPTIM2SMEN</name>
                     <description>LPTIM2SMEN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWPMI1SMEN</name>
                     <description>Single wire protocol clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SMEN</name>
                     <description>Low power UART 1 clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C4SMEN</name>
                     <description>I2C4 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2SMENR</name>
               <displayName>APB2SMENR</displayName>
               <description>APB2SMENR</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x01677C01</resetValue>
               <fields>
                  <field>
                     <name>DFSDMSMEN</name>
                     <description>DFSDM timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAI2SMEN</name>
                     <description>SAI2 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAI1SMEN</name>
                     <description>SAI1 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17SMEN</name>
                     <description>TIM17 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16SMEN</name>
                     <description>TIM16 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM15SMEN</name>
                     <description>TIM15 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SMEN</name>
                     <description>USART1clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM8SMEN</name>
                     <description>TIM8 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1SMEN</name>
                     <description>SPI1 clocks enable during Sleep and Stop               modes</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1SMEN</name>
                     <description>TIM1 timer clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMCSMEN</name>
                     <description>SDMMC clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSCFGSMEN</name>
                     <description>SYSCFG clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
