KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32L486.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPIOC</name>
         <description>General-purpose I/Os</description>
         <groupName>GPIO</groupName>
         <baseAddress>0x48000800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MODER</name>
               <displayName>MODER</displayName>
               <description>GPIO port mode register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODER15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTYPER</name>
               <displayName>OTYPER</displayName>
               <description>GPIO port output type register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OT15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSPEEDR</name>
               <displayName>OSPEEDR</displayName>
               <description>GPIO port output speed           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OSPEEDR15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUPDR</name>
               <displayName>PUPDR</displayName>
               <description>GPIO port pull-up/pull-down           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PUPDR15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
