KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32L486.svd
            <register>
               <name>DIEPTSIZ3</name>
               <displayName>DIEPTSIZ3</displayName>
               <description>device endpoint-3 transfer size           register</description>
               <addressOffset>0x170</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTXFSTS0</name>
               <displayName>DTXFSTS0</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x118</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTXFSTS1</name>
               <displayName>DTXFSTS1</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x138</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTXFSTS2</name>
               <displayName>DTXFSTS2</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DTXFSTS3</name>
               <displayName>DTXFSTS3</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x178</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOEPTSIZ1</name>
               <displayName>DOEPTSIZ1</displayName>
               <description>device OUT endpoint-1 transfer size           register</description>
               <addressOffset>0x330</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOEPTSIZ2</name>
               <displayName>DOEPTSIZ2</displayName>
               <description>device OUT endpoint-2 transfer size           register</description>
               <addressOffset>0x350</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOEPTSIZ3</name>
               <displayName>DOEPTSIZ3</displayName>
               <description>device OUT endpoint-3 transfer size           register</description>
               <addressOffset>0x370</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
